name: "EFNet"
layer{
    name: "data"
    type: "Input"
    top: "data"
    input_param{
        shape{
            dim: 64
            dim: 3
            dim: 224
            dim: 224
        }
    }
}
layer{
    name: "label"
    type: "Input"
    top: "label"
    input_param{
        shape{
            dim: 64
            dim: 1
        }
    }
}
layer{
  name: "gain"
  type: "Input"
  top: "gain"
  input_param{
    shape{
      dim: 1
    }
  }
}
layer{
  name: "augmentation"
  type: "Python"
  bottom: "data"
  bottom: "gain"
  top: "augmented"
  python_param{
    module: "augmentlayer"
    layer: "AugmentationLayer"
    param_str: "{'dropout': 0.4,'crop': 1,'coarse_dropout': 1,'flip_lr': 1,'flip_ud': 1,'rot90': 1, 'sigmoid':1, 'gamma': 1}"
  }
}
layer{
    name: "scale"
    type: "Python"
    bottom: "augmented"
    top: "scaled"
    python_param{
        module: "multiscaleimage"
        layer: "MultiScaleImage"
        param_str: "{'scales': '0.001'}"
    }
}
layer{
    name: "split"
    type: "Slice"
    bottom: "scaled"
    top: "x1"
    top: "x2"
    slice_param{
        axis: 1
        slice_point: 3
    }
}
layer{
    name: "si1_conv1"
    type: "Convolution"
    bottom: "x1"
    top: "si1_conv1"
    param{
        name: "si1_w"
        lr_mult: 1
        decay_mult: 1
    }
    convolution_param{
        num_output: 64
        kernel_size: 3
        pad: 1
        stride: 1
        bias_term: false
        weight_filler{
            type: "msra"
        }
    }
}
layer{
    name: "si1_relu1"
    type: "Sigmoid"
    bottom: "si1_conv1"
    top: "si1_conv1"
}
layer{
    name: "si1_conv2"
    type: "Convolution"
    bottom: "x2"
    top: "si1_conv2"
    param{
        name: "si1_w"
        lr_mult: 1
        decay_mult: 1
    }
    convolution_param{
        num_output: 64
        kernel_size: 3
        pad: 1
        stride: 1
        bias_term: false
        weight_filler{
            type: "msra"
        }
    }
}
layer{
    name: "si1_relu2"
    type: "Sigmoid"
    bottom: "si1_conv2"
    top: "si1_conv2"
}
layer{
    name: "si1_add"
    type: "Eltwise"
    bottom: "si1_conv1"
    bottom: "si1_conv2"
    top: "si1_input"
    eltwise_param{
        operation: SUM
        coeff: 1
        coeff: 1
    }
}
layer{
    name: "si1_pool"
    type: "Pooling"
    bottom: "si1_input"
    top: "si1_pool"
    pooling_param{
        pool: AVE
        kernel_size: 3
        pad: 1
        stride: 2
    }
}
layer{
    name: "si1_filter"
    type: "Convolution"
    bottom: "si1_pool"
    top: "si1_output"
    param{
        lr_mult: 1
        decay_mult: 1
    }
    convolution_param{
        num_output: 128
        kernel_size: 3
        pad: 1
        bias_term: false
        weight_filler{
            type: "msra"
        }
    }
}
layer{
    name: "si1_relu"
    type: "ReLU"
    bottom: "si1_output"
    top: "si1_output"
}
layer{
    name: "conv1"
    type: "Convolution"
    bottom: "augmented"
    top: "conv1"
    param{
        lr_mult: 1
        decay_mult: 1
    }
    param{
        lr_mult: 2
        decay_mult: 0
    }
    convolution_param{
        num_output: 256
        kernel_size: 3
        pad: 1
        weight_filler{
            type: "msra"
        }
        bias_filler{
            type: "constant"
            value: 0
        }
    }
}
layer{
    name: "relu1"
    type: "Sigmoid"
    bottom: "conv1"
    top: "conv1"
}
layer{
    name: "pool1"
    type: "Pooling"
    bottom: "conv1"
    top: "pool1"
    pooling_param{
        pool: MAX
        kernel_size: 7
        pad: 3
        stride: 2
    }
}
layer{
    name: "fusion1"
    type: "Concat"
    bottom: "pool1"
    bottom: "si1_output"
    top: "fused1"
}
layer{
    name: "conv2"
    type: "Convolution"
    bottom: "fused1" #112
    top: "conv2"
    param{
        lr_mult: 1
        decay_mult: 1
    }
    param{
        lr_mult: 2
        decay_mult: 0
    }
    convolution_param{
        num_output: 384
        kernel_size: 3
        pad: 1
        weight_filler{
            type: "msra"
        }
        bias_filler{
            type: "constant"
            value: 0
        }
    }
}
layer{
    name: "relu"
    type: "ReLU"
    bottom: "conv2"
    top: "conv2"
}
layer {
  name: "bn_conv2"
  type: "BatchNorm"
  bottom: "conv2"
  top: "conv2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats:false
  }
}
layer {
  name: "scale_conv2"
  type: "Scale"
  bottom: "conv2"
  top: "conv2"
  scale_param {
    bias_term: true
  }
}
layer{
    name: "pool2"
    type: "Pooling"
    bottom: "conv2"
    top: "pool2"
    pooling_param{
        pool: MAX
        kernel_size: 3
        pad: 1
        stride: 2
    }
}
layer{
    name: "conv3"
    type: "Convolution"
    bottom: "pool2" #56
    top: "conv3"
    param{
        lr_mult: 1
        decay_mult: 1
    }
    param{
        lr_mult: 2
        decay_mult: 0
    }
    convolution_param{
        num_output: 512
        kernel_size: 3
        pad: 1
        weight_filler{
            type: "msra"
        }
        bias_filler{
            type: "constant"
            value: 0
        }
    }
}
layer{
    name: "relu3"
    type: "ReLU"
    bottom: "conv3"
    top: "conv3"
}
layer {
  name: "bn_conv3"
  type: "BatchNorm"
  bottom: "conv3"
  top: "conv3"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats:false
  }
}
layer {
  name: "scale_conv3"
  type: "Scale"
  bottom: "conv3"
  top: "conv3"
  scale_param {
    bias_term: true
  }
}
layer{
    name: "pool3"
    type: "Pooling"
    bottom: "conv3"
    top: "pool3"
    pooling_param{
        pool: MAX
        kernel_size: 3
        pad: 1
        stride: 2
    }
}
layer{
    name: "conv4"
    type: "Convolution"
    bottom: "pool3" #28
    top: "conv4"
    param{
        lr_mult: 1
        decay_mult: 1
    }
    param{
        lr_mult: 2
        decay_mult: 0
    }
    convolution_param{
        num_output: 640
        kernel_size: 3
        pad: 1
        weight_filler{
            type: "msra"
        }
        bias_filler{
            type: "constant"
            value: 0
        }
    }
}
layer{
    name: "relu4"
    type: "ReLU"
    bottom: "conv4"
    top: "conv4"
}
layer {
  name: "bn_conv4"
  type: "BatchNorm"
  bottom: "conv4"
  top: "conv4"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats:false
  }
}
layer {
  name: "scale_conv4"
  type: "Scale"
  bottom: "conv4"
  top: "conv4"
  scale_param {
    bias_term: true
  }
}
layer{
    name: "pool4"
    type: "Pooling"
    bottom: "conv4"
    top: "pool4"
    pooling_param{
        pool: MAX
        kernel_size: 3
        pad: 1
        stride: 2
    }
}
layer{
    name: "conv5"
    type: "Convolution"
    bottom: "pool4" #14
    top: "conv5"
    param{
        lr_mult: 1
        decay_mult: 1
    }
    param{
        lr_mult: 1
        decay_mult: 0
    }
    convolution_param{
        num_output: 768
        kernel_size: 3
        pad: 1
        weight_filler{
            type: "msra"
        }
        bias_filler{
            type: "constant"
            value: 0
        }
    }
}
layer{
    name: "relu5"
    type: "ReLU"
    bottom: "conv5"
    top: "conv5"
}
layer {
  name: "bn_conv5"
  type: "BatchNorm"
  bottom: "conv5"
  top: "conv5"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats:false
  }
}
layer {
  name: "scale_conv5"
  type: "Scale"
  bottom: "conv5"
  top: "conv5"
  scale_param {
    bias_term: true
  }
}
layer{
    name: "pool5"
    type: "Pooling"
    bottom: "conv5"
    top: "pool5"
    pooling_param{
        kernel_size: 3
        pad: 1
        stride: 2
    }
}
layer{
    name: "conv6"
    type: "Convolution"
    bottom: "pool5"
    top: "conv6"
    param{
        lr_mult: 1
        decay_mult: 1
    }
    param{
        lr_mult: 2
        decay_mult: 0
    }
    convolution_param{
        num_output:1024
        kernel_size: 3
        pad: 1
        weight_filler{
            type: "msra"
        }
        bias_filler{
            type: "constant"
            value: 0
        }
    }
}
layer{
    name: "relu6"
    type: "ReLU"
    bottom: "conv6"
    top: "conv6"
}
layer{
    name: "pool6"
    type: "Pooling"
    bottom: "conv6"
    top: "pool6"
    pooling_param{
        pool: MAX
        kernel_size: 3
        pad: 1
        stride: 2
    }
}
layer{
    name: "class_conv1"
    type: "Convolution"
    bottom: "pool6" #7
    top: "class_conv1"
    param{
        lr_mult: 1
        decay_mult: 1
    }
    param{
        lr_mult: 2
        decay_mult: 0
    }
    convolution_param{
        num_output: 10
        kernel_size: 1
        weight_filler{
            type: "msra"
        }
        bias_filler{
            type: "constant"
            value: 0
        }
    }
}
layer{
    name: "class_relu1"
    type: "ReLU"
    bottom: "class_conv1"
    top: "class_conv1"
}
layer{
    name: "class_pool1"
    type: "Pooling"
    bottom: "class_conv1"
    top: "class_pool1"
    pooling_param{
        pool: AVE
        kernel_size: 5
    }
}
layer{
    name: "loss"
    type: "SoftmaxWithLoss"
    bottom: "class_pool1"
    bottom: "label"
    top: "loss-1"
}
layer{
    name: "accuracy"
    type: "Accuracy"
    bottom: "class_pool1"
    bottom: "label"
    top: "top-1"
}
layer{
    name: "module_fc"
    type: "InnerProduct"
    bottom: "si1_output"
    top: "module_output"
    param{
        lr_mult: 1
        decay_mult: 1
    }
    param{
        lr_mult: 2
        decay_mult: 0
    }
    inner_product_param{
        num_output: 10
        weight_filler{
            type: "msra"
        }
        bias_filler{
            type: "constant"
            value: 0
        }
    }
}
layer{
    name: "partial_loss"
    type: "SoftmaxWithLoss"
    bottom: "module_output"
    bottom: "label"
    top: "partial_loss-1"
    loss_weight: 0.1
}
layer{
    name: "partial_acc"
    type: "Accuracy"
    bottom: "module_output"
    bottom: "label"
    top: "partial_top1"
}
layer{
    name: "conv1_fc"
    type: "InnerProduct"
    bottom: "conv1"
    top: "conv1_output"
    param{
        lr_mult: 1
        decay_mult: 1
    }
    param{
        lr_mult: 2
        decay_mult: 0
    }
    inner_product_param{
        num_output: 10
        weight_filler{
            type: "msra"
        }
        bias_filler{
            type: "constant"
            value: 0
        }
    }
}
layer{
    name: "partial_loss2"
    type: "SoftmaxWithLoss"
    bottom: "conv1_output"
    bottom: "label"
    top: "partial_loss-2"
    loss_weight: 0.1
}
layer{
    name: "partial_acc2"
    type: "Accuracy"
    bottom: "conv1_output"
    bottom: "label"
    top: "partial_top2"
}